/* 
Библейская родословная от Адама и Евы до Ноя и его сыновей

*/

%facts
male('Адам').
female('Ева').
married('Адам','Ева').

male('Авель').
parent('Адам','Авель').
parent('Ева','Авель').

male('Сиф').
parent('Адам','Сиф').
parent('Ева','Сиф').
female('Азура').
married('Сиф','Азура').

male('Каин').
parent('Адам').
parent('Ева').

male('Енос').
parent('Сиф','Енос').
parent('Азура','Енос').

male('Каинан').
parent('Енос','Каинан').

male('Малелеил').
parent('Каинан','Мелелеил').

male('Иаред').
parent('Малелеил','Иаред').

male('Енох').
parent('Иаред','Енох').

male('Мафусаил').
parent('Енох','Мафусаил').

male('Ламех').
parent('Мафусаил','Ламех').

male('Ной').
parent('Ламех','Ной').

male('Сим').
parent('Ной','Сим').

male('Хам').
parent('Ной','Хам').

male('Иафет').
parent('Ной','Иафет').
